In [88]:
import pandas as pd

### Creating a DataFrame from a dict
Easiest way to create a dataframe is via a dictionary

In [89]:
data = {'fruit':['apples','lemons','bananas','oranges'],'color':['red','green','yellow','orange'],'price':[1.25,0.25,0.45,1]}
data

{'fruit': ['apples', 'lemons', 'bananas', 'oranges'],
 'color': ['red', 'green', 'yellow', 'orange'],
 'price': [1.25, 0.25, 0.45, 1]}

In [90]:
df = pd.DataFrame(data)
df

     fruit   color  price
0   apples     red   1.25
1   lemons   green   0.25
2  bananas  yellow   0.45
3  oranges  orange   1.00

#### Creating a dataframe with only certain columns from dictionary

In [91]:
df1 = pd.DataFrame(data,columns=['color','price'])
df1

    color  price
0     red   1.25
1   green   0.25
2  yellow   0.45
3  orange   1.00

#### index of Dataframe

In [92]:
df1.index = ['one','two','three','four']
df1

        color  price
one       red   1.25
two     green   0.25
three  yellow   0.45
four   orange   1.00

#### Selecting elements

In [93]:
#extract columns of dataframe
df.columns

Index(['fruit', 'color', 'price'], dtype='object')

In [94]:
# This returns the price column as a series.
df['price']

0    1.25
1    0.25
2    0.45
3    1.00
Name: price, dtype: float64

In [95]:
# Another the way to do the above command.
df.price

0    1.25
1    0.25
2    0.45
3    1.00
Name: price, dtype: float64

In [96]:
# Returns information of the second index as a series.
df.iloc[2]

fruit    bananas
color     yellow
price       0.45
Name: 2, dtype: object

In [97]:
df.iloc[:,2]

0    1.25
1    0.25
2    0.45
3    1.00
Name: price, dtype: float64

In [98]:
df.iloc[1,2]

0.25

In [99]:
df.iloc[1:3]

     fruit   color  price
1   lemons   green   0.25
2  bananas  yellow   0.45

??Size Mutable vs Value Mutable?? - What is this?

### Assigning Values

In [100]:
# Add a new column
df['quantity'] = [45,43,21,67]
df

     fruit   color  price  quantity
0   apples     red   1.25        45
1   lemons   green   0.25        43
2  bananas  yellow   0.45        21
3  oranges  orange   1.00        67

In [101]:
df['available'] = 'yes'
df

     fruit   color  price  quantity available
0   apples     red   1.25        45       yes
1   lemons   green   0.25        43       yes
2  bananas  yellow   0.45        21       yes
3  oranges  orange   1.00        67       yes

In [102]:
df['available'][2] = 'no'
df

/var/folders/5q/njvzx9bs35sg0dmp71490x800000gn/T/ipykernel_23790/4056232531.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['available'][2] = 'no'

     fruit   color  price  quantity available
0   apples     red   1.25        45       yes
1   lemons   green   0.25        43       yes
2  bananas  yellow   0.45        21        no
3  oranges  orange   1.00        67       yes

In [103]:
# Membership of a value
df.isin(['apples','red'])

   fruit  color  price  quantity  available
0   True   True  False     False      False
1  False  False  False     False      False
2  False  False  False     False      False
3  False  False  False     False      False

In [104]:
df[df.isin(['apples','red'])]

    fruit color  price  quantity available
0  apples   red    NaN       NaN       NaN
1     NaN   NaN    NaN       NaN       NaN
2     NaN   NaN    NaN       NaN       NaN
3     NaN   NaN    NaN       NaN       NaN

In [105]:
df

     fruit   color  price  quantity available
0   apples     red   1.25        45       yes
1   lemons   green   0.25        43       yes
2  bananas  yellow   0.45        21        no
3  oranges  orange   1.00        67       yes

In [106]:
# Deleting a Column
del(df['price'])
df

     fruit   color  quantity available
0   apples     red        45       yes
1   lemons   green        43       yes
2  bananas  yellow        21        no
3  oranges  orange        67       yes

In [107]:
# Filtering
df[(df['quantity'] > 40)]

     fruit   color  quantity available
0   apples     red        45       yes
1   lemons   green        43       yes
3  oranges  orange        67       yes

In [108]:
# Transposition of Dataframe
print(df)
print(df.T)

     fruit   color  quantity available
0   apples     red        45       yes
1   lemons   green        43       yes
2  bananas  yellow        21        no
3  oranges  orange        67       yes
                0       1        2        3
fruit      apples  lemons  bananas  oranges
color         red   green   yellow   orange
quantity       45      43       21       67
available     yes     yes       no      yes

### Indexing
Indexes in Dataframes are generally immutable. <br/>
You can change their labels, but cannot change the order

In [109]:
df.index = ['one','two','three','four']
df

         fruit   color  quantity available
one     apples     red        45       yes
two     lemons   green        43       yes
three  bananas  yellow        21        no
four   oranges  orange        67       yes

In [110]:
df.index = [1,2,3,4]
df

     fruit   color  quantity available
1   apples     red        45       yes
2   lemons   green        43       yes
3  bananas  yellow        21        no
4  oranges  orange        67       yes

In [111]:
df.index = [2,3,4,1]
df

     fruit   color  quantity available
2   apples     red        45       yes
3   lemons   green        43       yes
4  bananas  yellow        21        no
1  oranges  orange        67       yes

In [112]:
df

     fruit   color  quantity available
2   apples     red        45       yes
3   lemons   green        43       yes
4  bananas  yellow        21        no
1  oranges  orange        67       yes

#### Reindexing

In [113]:
#You can however make indices mutable using 'reindex'
df = df.reindex([1,3,4,5])
df

     fruit   color  quantity available
1  oranges  orange      67.0       yes
3   lemons   green      43.0       yes
4  bananas  yellow      21.0        no
5      NaN     NaN       NaN       NaN

In [114]:
df[(df['quantity']!=21)]

     fruit   color  quantity available
1  oranges  orange      67.0       yes
3   lemons   green      43.0       yes
5      NaN     NaN       NaN       NaN

In [115]:
# Forward fill (top-down)
df[(df['quantity']!=21)].reindex(range(6),method='ffill')

     fruit   color  quantity available
0      NaN     NaN       NaN       NaN
1  oranges  orange      67.0       yes
2  oranges  orange      67.0       yes
3   lemons   green      43.0       yes
4   lemons   green      43.0       yes
5      NaN     NaN       NaN       NaN

In [116]:
# Backward fill (down-top)
df=df[(df['quantity']!=21)].reindex(range(6),method='bfill')
df

     fruit   color  quantity available
0  oranges  orange      67.0       yes
1  oranges  orange      67.0       yes
2   lemons   green      43.0       yes
3   lemons   green      43.0       yes
4      NaN     NaN       NaN       NaN
5      NaN     NaN       NaN       NaN

#### Dropping

In [117]:
# Axis 0 corresponds to rows and axis 1 corresponds to columns.
df=df.drop([0,1],axis=0)
df

    fruit  color  quantity available
2  lemons  green      43.0       yes
3  lemons  green      43.0       yes
4     NaN    NaN       NaN       NaN
5     NaN    NaN       NaN       NaN

In [118]:
df=df.drop(['fruit','color'],axis=1)
df

   quantity available
2      43.0       yes
3      43.0       yes
4       NaN       NaN
5       NaN       NaN

#### Data Alignment

In [119]:
import numpy as np
df1 = pd.DataFrame(np.arange(16).reshape((4,4)),index=['red','blue','yellow','white'],columns=['ball','pen','pencil','paper'])
df2 = pd.DataFrame(np.arange(12).reshape((4,3)),index=['blue','green','white','yellow'],columns=['mug','pen','ball'])

In [120]:
df1

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [121]:
df2

        mug  pen  ball
blue      0    1     2
green     3    4     5
white     6    7     8
yellow    9   10    11

In [122]:
df1+df2

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

### Operations between Dataframes

In [123]:
#You can also try sub, mul, div
df1.add(df2)

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [124]:
ser = pd.Series([4,7,8,4],index=['ball','pen','pencil','paper'])
ser

ball      4
pen       7
pencil    8
paper     4
dtype: int64

In [125]:
df1-ser

        ball  pen  pencil  paper
red       -4   -6      -6     -1
blue       0   -2      -2      3
yellow     4    2       2      7
white      8    6       6     11

### Function Application and Mapping

In [126]:
df1

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [127]:
#Ufuncs
np.sqrt(df1)

            ball       pen    pencil     paper
red     0.000000  1.000000  1.414214  1.732051
blue    2.000000  2.236068  2.449490  2.645751
yellow  2.828427  3.000000  3.162278  3.316625
white   3.464102  3.605551  3.741657  3.872983

In [128]:
def func(x):
    return x.sum()

In [129]:
func(df1['ball'])

24

In [130]:
func(df1)

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [131]:
f = lambda x: x.sum()

In [132]:
f(df1['ball'])

24

In [133]:
df1.apply(f,axis=0)#for all rows

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [134]:
df1.apply(f,axis=1)#for all columns

red        6
blue      22
yellow    38
white     54
dtype: int64

In [135]:
#Statistical functions
df1.sum(axis=1)

red        6
blue      22
yellow    38
white     54
dtype: int64

In [136]:
#Statistical functions
df1.mean(axis=0)

ball      6.0
pen       7.0
pencil    8.0
paper     9.0
dtype: float64

In [137]:
#Statistical functions
df1.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

### Sorting and Ranking

In [138]:
df1

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [139]:
df1.sort_index(axis=1)

        ball  paper  pen  pencil
red        0      3    1       2
blue       4      7    5       6
yellow     8     11    9      10
white     12     15   13      14

In [140]:
df1.sort_index(axis=0)

        ball  pen  pencil  paper
blue       4    5       6      7
red        0    1       2      3
white     12   13      14     15
yellow     8    9      10     11

In [141]:
df1.sort_values(by='pen')

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

### Correlation and Covariance
Covariance signifies the direction of linear relationship amongst two attributes <br/>
Correlation signifies the direction and strength.(a standardized version of covariance and is between -1 and 1)

In [142]:
df3 = pd.DataFrame([[1,4,3,6],[4,5,6,1],[3,3,1,5],[4,1,6,4]],columns=['ball','pen','pencil','paper'])
df3

   ball  pen  pencil  paper
0     1    4       3      6
1     4    5       6      1
2     3    3       1      5
3     4    1       6      4

In [143]:
df3.corr()

            ball       pen    pencil     paper
ball    1.000000 -0.276026  0.577350 -0.763763
pen    -0.276026  1.000000 -0.079682 -0.361403
pencil  0.577350 -0.079682  1.000000 -0.692935
paper  -0.763763 -0.361403 -0.692935  1.000000

In [144]:
df3.cov()

            ball       pen    pencil     paper
ball    2.000000 -0.666667  2.000000 -2.333333
pen    -0.666667  2.916667 -0.333333 -1.333333
pencil  2.000000 -0.333333  6.000000 -3.666667
paper  -2.333333 -1.333333 -3.666667  4.666667

### NaN Data

In [145]:
df3.iloc[0,1]=None #sets a value to NaN
df3

   ball  pen  pencil  paper
0     1  NaN       3      6
1     4  5.0       6      1
2     3  3.0       1      5
3     4  1.0       6      4

In [146]:
#dropping rows with NaN values - one way to handle missing data
df3.dropna()

   ball  pen  pencil  paper
1     4  5.0       6      1
2     3  3.0       1      5
3     4  1.0       6      4

In [147]:
#if you want to delete rows only when all the values in the row are NaNs
df3.dropna(how="all")

   ball  pen  pencil  paper
0     1  NaN       3      6
1     4  5.0       6      1
2     3  3.0       1      5
3     4  1.0       6      4

In [148]:
# Replace all NaN values with a specific value.
df3.fillna(0)

   ball  pen  pencil  paper
0     1  0.0       3      6
1     4  5.0       6      1
2     3  3.0       1      5
3     4  1.0       6      4